---
kind: method
id: M:Autodesk.Revit.UI.Events.DialogBoxData.OverrideResult(System.Int32)
source: html/43d9c4d8-fdb1-a4b2-bdc2-6eaff0f595f3.htm
---
# Autodesk.Revit.UI.Events.DialogBoxData.OverrideResult Method

Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.

## Syntax (C#)
```csharp
public bool OverrideResult(
	int result
)
```

## Parameters
- **result** (`System.Int32`) - The result code you wish the Revit dialog to return.

## Returns
Returns true if the result code was accepted.